In [2]:
import pandas as pd
df=pd.read_csv(r"C:\\class 8(a)\\8(1).txt")

In [3]:
df

   Friends names|Quality
0      ruchitha|innocent
1             geetha|joy
2    hareesh|intelligent
3     supraja|spiritcual
4              sai|anger
5  lakshmi|silent killer
6           divya|silent
7       krupa|brave girl
8            rajini|funn
9        swarna|comedian

In [2]:
def products(purchase_products,purchase_amount,discount):
    if purchase_products=="a":
        discount=purchase_amount*0.3 
        print("jio offer=30%")  
        discount=purchase_amount*0.4
        print("reliance offer=40%")
        
        
    elif purchase_products=="b":
            discount=purchase_amount*0.5 
            print("jio offer=0.5%")
            discount=purchase_amount*0.5
            print("reliance offer=0.0%")
            
            
    elif purchase_products=="a+b":
            print("jio offer=0.5%")
            print("reliance offer=0.0%")
            
             
    elif purchase_products=="c":
            discount=purchase_amount*0.5 
            print("jio offer=0.5%")
            discount=purchase_amount*0.5
            print("reliance offer=0.0%")
            
            
    elif purchase_products=="a+b+c":
            discount=purchase_amount*0.5
            print("jio offer=0.5%")
            print("reliance offer=0.0%")

            
           
        
    elif purchase_products=="d":
            discount=purchase_amount*0.5  
            print("jio offer=0.5%")
            discount=purchase_amount*0.5
            print("reliance offer=0.0%")
            
            
    elif purchase_products=="a+b+c+d":
            print("jio offer=0.5%")
            print("reliance offer=0.0%")
   
   
    return discount

In [3]:
 products("a+b+c+d",10000,0.5)

jio offer=0.5%
reliance offer=0.0%

0.5

In [67]:
 
             
    elif purchase_products=="c":
            discount=purchase_amount*0.5 
            print("jio offer=0.5%")
            discount=purchase_amount*0.5
            print("reliance offer=0.0%")
            
            
    elif purchase_products=="a+b+c":
            print("jio offer=0.5%")
            print("reliance offer=0.0%")

SyntaxError: invalid syntax (451639011.py, line 2)

In [135]:
 products("b",10000,0.5)

jio offer=0.5%
reliance offer=0.0%

5000.0

In [103]:
 def products(purchase_products,purchase_amount,discount):
        if purchase_products=="c":
            discount=purchase_amount*0.5
            print("reliance offer=0.5%")
            print("jio offer=0.0%")
            
            
        elif purchase_products=="a+b+c":
            print("jio offer=0.5%")
            print("reliance offer=0.0%")
            return discount

In [104]:
 products("c",10000,0.3)

reliance offer=0.5%
jio offer=0.0%

In [13]:
products("a",500,0.3)

0.3

In [2]:
import pandas as pd
df=pd.read_csv(r"C:\Jayasri\class-9\09-01.txt")
df

  Friend’s names        Quality
0        Rohitha       innocent
1         Geetha            Joy
2        Hareesh    intelligent
3        Supraja     spiritcual
4            Sai          anger
5        Lakshmi  silent killer
6          Divya         silent
7          Krupa     brave girl
8         Rajini            fun
9         Swarna       comedian

In [ ]:
elif purchase_products=="c":
            discount=purchase_amount*0.5
            print("reliance offer=0.5%")
            print("jio offer=0.0%")
            
            
    elif purchase_products=="a+b+c":
            print("jio offer=0.5%")
            print("reliance offer=0.0%")

In [3]:
import pandas as pd
df=pd.read_csv(r"C:\Jayasri\class-9\09-01.txt")
df

  Friend’s names        Quality
0        Rohitha       innocent
1         Geetha            Joy
2        Hareesh    intelligent
3        Supraja     spiritcual
4            Sai          anger
5        Lakshmi  silent killer
6          Divya         silent
7          Krupa     brave girl
8         Rajini            fun
9         Swarna       comedian

In [4]:
df.head()

  Friend’s names       Quality
0        Rohitha      innocent
1         Geetha           Joy
2        Hareesh   intelligent
3        Supraja    spiritcual
4            Sai         anger

In [5]:
df.tail()

  Friend’s names        Quality
5        Lakshmi  silent killer
6          Divya         silent
7          Krupa     brave girl
8         Rajini            fun
9         Swarna       comedian

In [6]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.dtypes

Friend’s names    object
 Quality          object
dtype: object

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Friend’s names  10 non-null     object
 1    Quality        10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [10]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [12]:
df.columns

Index(['Friend’s names', ' Quality'], dtype='object')

In [13]:
df.shape

(10, 2)

In [14]:
type(df)

pandas.core.frame.DataFrame

In [17]:
import pandas as pd
df_friends=pd.read_excel(r"C:\Jayasri\class - 10\friends names.xlsx")
df_friends

   Friend’s names        Quality
0         Rohitha       innocent
1          Geetha            Joy
2         Hareesh    intelligent
3         Supraja    intelligent
4             Sai          anger
5         Lakshmi  silent killer
6           Divya          funny
7           Krupa     brave girl
8          Rajini          funny
9          Swarna    intelligent
10        mounika          funny
11         bhanu     intelligent
12   naga lakshmi          funny
13         anusha          funny

In [22]:
import pandas as pd
df=pd.read_excel(r"C:\Jayasri\class - 10\friends names.xlsx")
df

df_fil_friends=df[df["Quality"]=="intelligent"]
df_fil_friends


df_friends=df[df["Quality"]=="intelligent"]
df_friends


df_friends_funny=df[df["Quality"]=="funny"]
df_friends_funny

   Friend’s names Quality
6           Divya   funny
8          Rajini   funny
10        mounika   funny
12   naga lakshmi   funny
13         anusha   funny

In [23]:
df_fil_friends=df[df["Quality"]=="intelligent"]
df_fil_friends

   Friend’s names      Quality
2         Hareesh  intelligent
3         Supraja  intelligent
9          Swarna  intelligent
11         bhanu   intelligent

In [24]:
import pandas as pd
df=pd.read_excel(r"C:\Jayasri\class - 10\friends names.xlsx")
df

   Friend’s names        Quality
0         Rohitha       innocent
1          Geetha            Joy
2         Hareesh    intelligent
3         Supraja    intelligent
4             Sai          anger
5         Lakshmi  silent killer
6           Divya          funny
7           Krupa     brave girl
8          Rajini          funny
9          Swarna    intelligent
10        mounika          funny
11         bhanu     intelligent
12   naga lakshmi          funny
13         anusha          funny

In [33]:
import pandas as pd
df=pd.read_excel(r"C:\Jayasri\class - 10\family members.xlsx",sheet_name="sheet2")
df

   Unnamed: 0  Unnamed: 1 Unnamed: 2
0         NaN         NaN        NaN
1         NaN         NaN        NaN
2         NaN         NaN        NaN
3         NaN         NaN        NaN
4         NaN         NaN        NaN
5         NaN         NaN        NaN
6         NaN         NaN    jayasri

In [40]:

df_family=df[(df["Relation"]=="brother") & (df["Relation"]=="sister")]
df_family

KeyError: 'Relation'

In [39]:
df_family=pd.read_excel(r"C:\Jayasri\class - 10\family members.xlsx")
df_family

#create a dataframe which contains only your brothers and sisters list.
#Q2> create a dataframe which contains only your parents list.
#Q3> create a dataframe which not contains your parents list.
#Q4> create a dataframe which not contains your brothers list.

    Family Members        Relation
0     JanardhnaRao          Father
1          Lakshmi          mother
2          Mounika          sister
3   Devivaraprasad         brother
4          Jayasri          myself
5        Basavaiah     grandfather
6             Rama           aunty
7       Ashokkumar  brother-in-law
8           Rajini   sister-in-law
9           rakesh         brother
10      rajasekhar         brother
11    bala krishna         brother
12           bhanu   sister-in-law
13        rangamma   sister-in-law
14          parvin          sister
15         shabana          sister

In [42]:
df_family=df[df["Family Member"]=="rama"]
df_family

KeyError: 'Family Member'